# Selecting and Filtering data

Working with data almost always involves selection and filetering to focus on specific subsets of information within datasets.  
Here we cover some techniques provided by pandas for selecting columns and filtering rows based on specified conditions.

**Sample data**:

In [1]:
import pandas as pd

In [2]:
data = {
    'employee_id': [2, 3, 4, 7, 8, 9],
    'name': ['Sal', 'Yang', 'Khaya', 'Lin', 'Eve', 'Mike'],
    'department': ['Sales', 'Marketing', 'Engineering', 'Sales', 'Engineering', 'Sales'],
    'salary': [60000, 75000, 80000, 62000, 90000, 70000]
}
df = pd.DataFrame(data)
df

   employee_id   name   department  salary
0            2    Sal        Sales   60000
1            3   Yang    Marketing   75000
2            4  Khaya  Engineering   80000
3            7    Lin        Sales   62000
4            8    Eve  Engineering   90000
5            9   Mike        Sales   70000

## Selecting specific columns

To select only the `name` and `salary` columns:

In [3]:
df[['name', 'salary']]

    name  salary
0    Sal   60000
1   Yang   75000
2  Khaya   80000
3    Lin   62000
4    Eve   90000
5   Mike   70000

## Filtering rows based on a condition

In [4]:
engineers = df[df['department'] == 'Engineering']
engineers

   employee_id   name   department  salary
2            4  Khaya  Engineering   80000
4            8    Eve  Engineering   90000

You can also include multiple conditions by including more expressions or using the `isin` method:

In [5]:
sales_or_marketing = df[df['department'].isin(['Sales', 'Marketing'])]
sales_or_marketing

   employee_id  name department  salary
0            2   Sal      Sales   60000
1            3  Yang  Marketing   75000
3            7   Lin      Sales   62000
5            9  Mike      Sales   70000